# **Homework 2: Functions and Loops (20 points)**

#### **Dylan Watson**

---
**Instructions**: Complete the homework assignment below.
- <font color=red>Tasks</font> indicated in red must be completed to receive credit
- Include all code for your work
- Include markdown cells with written answers explaining your work when prompted
- Your completed assignment must be submitted to Canvas as a .ipynb file by the deadline listed on Canvas
---

<br>

####<font color=red>Organized</font> (1 point)
* Answers should be organized in the following format for organization and readability

<br>

```
# 1. 
This will be the code block to answer the first part of a task
```

1. This will be the text answer/explanation (if prompted) for the first task

```
# 2. 
This will be the code block to answer the second part of a task
```

2. This will be the text answer/explanation (if prompted) for the second task

<br>

Continue this format for the remaining subtasks

<br>

---

<br>

####<font color=red>Task 1</font>  (2 points)

1. (1 point) Load the csv file on employee attrition available [here](https://raw.githubusercontent.com/nelson-wu/employee-attrition-ml/master/WA_Fn-UseC_-HR-Employee-Attrition.csv)

2. (1 point) View the first few rows using `head()` to ensure the data is formatted properly

In [1]:
url = "https://raw.githubusercontent.com/nelson-wu/employee-attrition-ml/master/WA_Fn-UseC_-HR-Employee-Attrition.csv"
download.file(url, destfile = "data.csv", method = "auto")
dat <- read.csv("data.csv")

In [2]:
head(dat)
nrow(dat)
df = data.frame(dat$Education, dat$MonthlyIncome, dat$Attrition, dat$RelationshipSatisfaction)
df

  Age Attrition BusinessTravel    DailyRate Department
1 41  Yes       Travel_Rarely     1102      Sales
2 49  No        Travel_Frequently  279      Research & Development
3 37  Yes       Travel_Rarely     1373      Research & Development
4 33  No        Travel_Frequently 1392      Research & Development
5 27  No        Travel_Rarely      591      Research & Development
6 32  No        Travel_Frequently 1005      Research & Development
  DistanceFromHome Education EducationField EmployeeCount EmployeeNumber ⋯
1 1                2         Life Sciences  1             1              ⋯
2 8                1         Life Sciences  1             2              ⋯
3 2                2         Other          1             4              ⋯
4 3                4         Life Sciences  1             5              ⋯
5 2                1         Medical        1             7              ⋯
6 2                2         Life Sciences  1             8              ⋯
  RelationshipSatisfaction StandardHours StockOptionLevel TotalWorkingYears
1 1                        80            0                 8
2 4                        80            1                10
3 2                        80            0                 7
4 3                        80            0                 8
5 4                        80            1                 6
6 3                        80            0                 8
  TrainingTimesLastYear WorkLifeBalance YearsAtCompany YearsInCurrentRole
1 0                     1                6             4
2 3                     3               10             7
3 3                     3                0             0
4 3                     3                8             7
5 3                     3                2             2
6 2                     2                7             7
  YearsSinceLastPromotion YearsWithCurrManager
1 0                       5
2 1                       7
3 0                       0
4 3                       0
5 2                       2
6 3                       6

[1] 1470

     dat.Education dat.MonthlyIncome dat.Attrition dat.RelationshipSatisfaction
1    2              5993             Yes           1
2    1              5130             No            4
3    2              2090             Yes           2
4    4              2909             No            3
5    1              3468             No            4
6    2              3068             No            3
7    3              2670             No            1
8    1              2693             No            2
9    3              9526             No            2
10   3              5237             No            2
11   3              2426             No            3
12   2              4193             No            4
13   1              2911             No            4
14   2              2661             No            3
15   3              2028             Yes           2
16   4              9980             No            3
17   2              3298             No            4
18   2              2935             No            2
19   4             15427             No            3
20   3              3944             No            3
21   2              4011             No            4
22   4              3407             Yes           2
23   4             11994             No            3
24   2              1232             No            4
25   1              2960             Yes           3
26   3             19094             No            4
27   1              3919             Yes           2
28   4              6825             No            4
29   4             10248             No            4
30   4             18947             No            4
⋮    ⋮             ⋮                 ⋮             ⋮
1441 2              5131             No            2
1442 4              6306             No            1
1443 4              4787             Yes           2
1444 3             18880             No            1
1445 2              2339             Yes           4
1446 4             13570             No            3
1447 3              6712             No            4
1448 4              5406             No            1
1449 3              8938             No            3
1450 3              2439             No            4
1451 4              8837             No            3
1452 2              5343             No            3
1453 4              6728             Yes           4
1454 4              6652             No            1
1455 3              4850             No            3
1456 4              2809             No            4
1457 4              5689             No            4
1458 4              2001             No            2
1459 4              2977             No            4
1460 2              4025             No            1
1461 4              3785             No            2
1462 3             10854             Yes           2
1463 1             12031             No            1
1464 3              9936             No            2
1465 3              2966             No            4
1466 2              2571             No            3
1467 1              9991             No            1
1468 3              6142             No            2
1469 3              5390             No            4
1470 3              4404             No            1

<br>

---

<br>

####<font color=red>Task 2</font>  (6 points)

1. (1 point) Find the unique values of the variable `Education`, sort the unique values, and store as a variable.
  * 1 = Some high school
  * 2 = High School
  * 3 = Some college
  * 4 = College
  * 5 = Graduate School

2. (2 point) Use a `for` loop to find the average `MonthlyIncome` for each unique `Education` level. Show code and output.

3. (1 point) Which education level has the highest salary? State in a complete sentence.

4. (1 point) Which education level has the lowest salary? State in a complete sentence.

5. (1 point) Does the relationship between education level and monthly salary make sense? Explain.

In [3]:
education_values = sort(unique(dat$Education))
education_values

for (i in education_values) {
    print(i)
    print(mean(dat$MonthlyIncome[dat$Education == i]))
}

[1] 1 2 3 4 5

[1] 1
[1] 5640.571
[1] 2
[1] 6226.645
[1] 3
[1] 6517.264
[1] 4
[1] 6832.402
[1] 5
[1] 8277.646

There are 5 unique educqation values numbered 1 through 5 corresponding to some high school through graduate school. The education level with the highest salary is level 5 or graduate school. The education level with the lowest salary is 1 or some high school. There is a positive relationship between level of education and salary. Yes this positive relationship makes as higher levels of education enable higher productivity and value generation in careers like medicine, research, technology, etc.

<br>

---

<br>

####<font color=red>Task 3</font>  (3 points)

1. (2 points) Use `tapply` to find the average `MonthlyIncome` for each unique `Education` level. Show code and output.

2. (1 point) Create a dataframe with two columns. One column should be unique education level. One column should be average income

In [4]:
education_salary = data.frame(EducationVals = sort(unique(dat$Education)), MeanMonthlyIncome = tapply(dat$MonthlyIncome, dat$Education, mean))
education_salary

  EducationVals MeanMonthlyIncome
1 1             5640.571
2 2             6226.645
3 3             6517.264
4 4             6832.402
5 5             8277.646

<br>

---

<br>

####<font color=red>Task 4</font>  (2 points)

1. (1 point) Use `tapply` to find the average `MonthlyIncome` for those who quit (`Attrition`=Yes) and those who did not quit (`Attrition`=No). Show code and output.

2. (1 point) Do you observe differences in the monthly income between those who quit (`Attrition`=Yes) and those who do not (`Attrition`=Yes)? Explain your answer.

In [5]:
attrition_salary = data.frame(AttritionVals = sort(unique(dat$Attrition)), MeanMonthlyIncome = tapply(dat$MonthlyIncome, dat$Attrition, mean))
attrition_salary

    AttritionVals MeanMonthlyIncome
No  No            6832.740
Yes Yes           4787.093

Yes there is a significant difference in mean monthly income of those who quit and who did not. Those who quit had a much lower mean monthly income. One theory is that those who were underpaid are more likely to seek other employment.

<br>

---

<br>

####<font color=red>Task 5</font>  (6 points)

1. (3 points) Create a function that calculates the mean, min, max, and max minus min of a variable for each unique value of another variable
  * Inputs
    * variable - the variable of which you are taking mean, min, max, and max minus min
    * factor_variable - the variable for which you are using unique values
  * Ouput - Dataframe with 
    * row names mean, min, max, max-min
    * a unique value of factor_variable for each column

```
vector_summary <- function(x) {
  return(c(mean(x), min(x), max(x), max(x) - min(x)))
}

factor_summary <- function(variable, factor_variable) {


  return(...)
}
```

<br>
2. (2 points) Using your function, run the following commands



```
factor_summary(dat$MonthlyIncome, dat$Education)
```
```
factor_summary(dat$MonthlyIncome, dat$Attrition)
```
```
factor_summary(dat$MonthlyIncome, dat$RelationshipSatisfaction)
```

<br>

3. (1 point) What do you notice about the relationship between monthly income and relationship satisfaction? Explain your answer.

In [6]:
vector_summary <- function(x) {
    return(c(mean(x), min(x), max(x), max(x) - min(x)))
}

factor_summary <- function(variable, factor_variable) {
    list_array = tapply(variable, factor_variable, vector_summary)
    transposed_array <- do.call(rbind, list_array)
    factors_vector_summaries = data.frame(Factor = sort(unique(factor_variable)), Mean = transposed_array[,1], Min = transposed_array[,2], Max = transposed_array[,3], Range = transposed_array[,4])
    return(factors_vector_summaries)
}

factor_summary(dat$MonthlyIncome, dat$Education)
factor_summary(dat$MonthlyIncome, dat$Attrition)
factor_summary(dat$MonthlyIncome, dat$RelationshipSatisfaction)

  Factor Mean     Min  Max   Range
1 1      5640.571 1009 19973 18964
2 2      6226.645 1051 19613 18562
3 3      6517.264 1081 19926 18845
4 4      6832.402 1359 19999 18640
5 5      8277.646 2127 19586 17459

    Factor Mean     Min  Max   Range
No  No     6832.740 1051 19999 18948
Yes Yes    4787.093 1009 19859 18850

  Factor Mean     Min  Max   Range
1 1      6177.793 1200 19999 18799
2 2      6596.983 1052 19973 18921
3 3      6543.773 1081 19701 18620
4 4      6601.296 1009 19943 18934

There is a noticeably lower mean income for those with a relationship satisfaction factor of 1 than of the other factors 2, 3, and 4. This implies that while there is no relationship between income and being in any of the higher relationship factors as they are the same in mean, that those of lower income are more likely to be in an unhappy relationship.

<br>